xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/wdg_17_scu_infineon_tricore/ssc/src/Wdg_17_Scu.c
/******************************************************************************
**                                                                           **
** Copyright (C) Infineon Technologies (2015)                                **
**                                                                           **
** All rights reserved.                                                      **
**                                                                           **
** This document contains proprietary information belonging to Infineon      **
** Technologies. Passing on and copying of this document, and communication  **
** of its contents is not permitted without prior written authorization.     **
**                                                                           **
*******************************************************************************
**                                                                           **
**  $FILENAME   : Wdg_17_Scu.c $                                             **
**                                                                           **
**  $CC VERSION : \main\104 $                                                **
**                                                                           **
**  $DATE       : 2016-07-15 $                                               **
**                                                                           **
**  AUTHOR      : DL-AUTOSAR-Engineering                                     **
**                                                                           **
**  VENDOR      : Infineon Technologies                                      **
**                                                                           **
**  DESCRIPTION : This file contains functionality of WDG driver.            **
**                                                                           **
**                                                                           **
**  MAY BE CHANGED BY USER [yes/no]: NO                                      **
**                                                                           **
******************************************************************************/

/*******************************************************************************
**                      Includes                                              **
*******************************************************************************/
/*  TRACEABILITY: [cover parentID=SAS_NAS_ALL_PR749,SAS_NAS_ALL_PR470,
                 SAS_NAS_ALL_PR70,SAS_NAS_ALL_PR1652,SAS_NAS_ALL_PR630_PR631]   
                   [/cover]                                                  */

/* WDG061: Inclusion structure */
  /* Inclusion of controller sfr file */
#include "IfxScu_reg.h"
#include "IfxScu_bf.h"

/* Global functions like Set/Reset END INIT protection bit,
  Enable/Disable interrupts, Automic write function */
#include "Mcal.h"
/* Inclusion of Wdg module header file */
#include "Wdg_17_Scu.h"
#if (WDG_MAXQM_TIMERS != 0U)
#include "Wdg_17_Scu_Local.h"
#endif

/* Include WDG Schm files  */
#include "SchM_17_McalCfg.h"
#include SCHM_WDG_17_SCU_HEADER

/* Include Safe WDG header file */
#if (WDG_MAXSAFE_TIMERS != 0U)
#include "Wdg_17_Scu_Safe.h"
#endif

/* Include SchM_Wdg header file to export EA access functions */
/* Traceability : [cover parentID=DS_AS_WDG040][/cover]         */


#if (WDG_MAXQM_TIMERS != 0U)
/* Include Wdg_Cbk File*/
#include "Wdg_17_Scu_Cbk.h"

/* Gtm related information are brought in from here */
#include "Gtm.h"
#endif

/** Traceability : [cover parentID=SAS_AS_WDG062, DS_AS_WDG110][/cover]  */
#if((WDG_DISABLE_REJECT_DEM_REPORT == ENABLE_DEM_REPORT) ||                 \
    (WDG_MODE_FAIL_DEM_REPORT == ENABLE_DEM_REPORT) ||                      \
    (WDG_INIT_FAILED_DEM_REPORT == ENABLE_DEM_REPORT))
#include "Dem.h"
#endif


/*******************************************************************************
**                      Imported Compiler Switch Checks                       **
*******************************************************************************/

#ifndef WDG_17_SCU_AR_RELEASE_MAJOR_VERSION
  #error "WDG_17_SCU_AR_RELEASE_MAJOR_VERSION is not defined. "
#endif

#ifndef WDG_17_SCU_AR_RELEASE_MINOR_VERSION
  #error "WDG_17_SCU_AR_RELEASE_MINOR_VERSION is not defined. "
#endif

#ifndef WDG_17_SCU_AR_RELEASE_REVISION_VERSION
  #error "WDG_17_SCU_AR_RELEASE_REVISION_VERSION is not defined. "
#endif

#if ( WDG_17_SCU_AR_RELEASE_MAJOR_VERSION != 4U)
  #error "WDG_17_SCU_AR_RELEASE_MAJOR_VERSION does not match. "
#endif

#if ( WDG_17_SCU_AR_RELEASE_MINOR_VERSION != 0U )
  #error "WDG_17_SCU_AR_RELEASE_MINOR_VERSION does not match. "
#endif

#ifndef WDG_17_SCU_SW_MAJOR_VERSION
  #error "WDG_17_SCU_SW_MAJOR_VERSION is not defined. "
#endif

#ifndef WDG_17_SCU_SW_MINOR_VERSION
  #error "WDG_17_SCU_SW_MINOR_VERSION is not defined. "
#endif

#ifndef WDG_17_SCU_SW_PATCH_VERSION
  #error "WDG_17_SCU_SW_PATCH_VERSION is not defined. "
#endif

/* Check for Correct inclusion of headers */
#if ( WDG_17_SCU_SW_MAJOR_VERSION != 3U )
  #error "WDG_17_SCU_SW_MAJOR_VERSION does not match. "
#endif

#if ( WDG_17_SCU_SW_MINOR_VERSION != 4U )
  #error "WDG_17_SCU_SW_MINOR_VERSION does not match. "
#endif

/* Traceability : [cover parentID=DS_AS40X_WDG087][/cover]                    */
/*------------------------------------------------------------------------------
                            DEM File inclusion
------------------------------------------------------------------------------*/
/*If DEM is enabled, the check for DEM versions*/
#if( (WDG_DISABLE_REJECT_DEM_REPORT == ENABLE_DEM_REPORT) ||\
     (WDG_MODE_FAIL_DEM_REPORT == ENABLE_DEM_REPORT) )

#ifndef DEM_AR_RELEASE_MAJOR_VERSION
  #error "DEM_AR_RELEASE_MAJOR_VERSION is not defined. "
#endif
#ifndef DEM_AR_RELEASE_MINOR_VERSION
  #error "DEM_AR_RELEASE_MINOR_VERSION is not defined. "
#endif

#if (IFX_DEM_VERSION_CHECK == STD_ON)

