xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/wdg_17_scu_infineon_tricore/ssc/src/Wdg_17_Scu.c
#if ( DEM_AR_RELEASE_MAJOR_VERSION != 4U )
  #error "DEM_AR_RELEASE_MAJOR_VERSION does not match. "
#endif
#if ( DEM_AR_RELEASE_MINOR_VERSION != 0U )
  #error "DEM_AR_RELEASE_MINOR_VERSION does not match. "
#endif

#endif /*  (IFX_DEM_VERSION_CHECK == STD_ON)  */

#endif
/*------------------------------------------------------------------------------
                            DET File inclusion
------------------------------------------------------------------------------*/

#if (WDG_DEV_ERROR_DETECT == STD_ON)

#ifndef DET_AR_RELEASE_MAJOR_VERSION
  #error "DET_AR_RELEASE_MAJOR_VERSION is not defined. "
#endif
#ifndef DET_AR_RELEASE_MINOR_VERSION
  #error "DET_AR_RELEASE_MINOR_VERSION is not defined. "
#endif
#if (IFX_DET_VERSION_CHECK == STD_ON)

#if ( DET_AR_RELEASE_MAJOR_VERSION != 4U )
  #error "DET_AR_RELEASE_MAJOR_VERSION does not match. "
#endif
#if ( DET_AR_RELEASE_MINOR_VERSION != 0U )
  #error "DET_AR_RELEASE_MINOR_VERSION does not match. "
#endif

#endif /* (IFX_DET_VERSION_CHECK == STD_ON) */
#endif /*End for WDG_DEV_ERROR_DETECT */
/*----------------------------------------------------------------------------*/

/*******************************************************************************
**                      Private Macro Definitions                             **
*******************************************************************************/


/* Masks the 16bit WDT reload value */
#define WDG_MASK_WDTREL                (0xFFFF0000U)

/* Sets the WDTIR bit and enables the watchdog by resetting WDTDR
   bit in WDTCON1 */
#define WDG_SET_WDTIR_RESET_WDTDR      (0x00000004U)

/* Resets the WDTIR bit and enables the watchdog by resetting WDTDR
   bit in WDTCON1 */
#define WDG_RESET_WDTIR_RESET_WDTDR    (0x00000000U)

/* Mask for Watchdog status in WDTSR*/
#define WDG_STATUS_MASK                 (0x0000003CU)

/* This is the reload value which will triiger an almost instant reset */
#define WDG_INSTANT_RESET_RELOAD_VALUE (0xFFFFU) /* 1 tick near reset */

/* Shift value of REL in WDTCPU0CON0 SFR*/
#define WDG_REL_SHIFT_VALUE             (16U)

/* To mask password */
#define WDT_PASS_MASK                  (0x0000FFFCU)

/* Password mask BIT[15:8] */
#define WDT_PASS_UPPER_MASK            (0x0000FF00U)

/* Password mask BIT[7:2] */
#define WDT_PASS_LOWER_MASK            (0x000000FCU)

/* Set LCK and ENDINIT bit in WDTCPUxCON0*/
#define WDT_SETLCK_ENDINIT             (0x00000003U)

/* Register Mapping for WDG */
#define WDG_REGMAP       ((Ifx_SCU_WDTCPU*)(void*)&(SCU_WDTCPU0_CON0))

#define WDG_CON1_DR_SETMASK            (0x00000008U)
#define WDG_CON1_DR_CLEARMASK          (0xFFFFFFFFU)
#define WDG_SR_TO_MASK                 (0x00000010U)
#define WDG_SR_DS_MASK                 (0x00000008U)
#define WDG_SR_TO_BITPOS               (4U)
#define WDG_SR_DS_BITPOS               (3U)

/*******************************************************************************
**                      Private Type Definitions                              **
*******************************************************************************/

/*******************************************************************************
**                      Private Function Declarations                         **
*******************************************************************************/
#define WDG_17_SCU_START_SEC_CODE
#include "MemMap.h"


/* Function to Access password before accessing ENDINIT registers */
IFX_LOCAL_INLINE uint32 Wdg_lAccessPassword(uint32 WdtCon0);

/* Function to Check if  Password Sequencing Or Time Checking is enabled */
IFX_LOCAL_INLINE Std_ReturnType Wdg_lCheckPassSeqOrTimeCheck(void);

/* Function to Modify the ENDINIT registers */
IFX_LOCAL_INLINE uint32 Wdg_lReloadModifyAccess(uint16 ReloadValue);

/* Calculate password to be put in the CON0 SFR */
IFX_LOCAL_INLINE uint32 Wdg_lModifyAccessPassword(uint32 PasswordAccess);

#if (WDG_MAXQM_TIMERS != 0U)
/* WDGx QM initialization */
static void Wdg_lQmInit(const Wdg_17_Scu_ConfigType* ConfigPtr); 
  
/* Function to change mode of WDG. Available modes are WDGIF_OFF_MODE,
   WDGIF_SLOW_MODE and WDGIF_FAST_MODE*/
/*  [cover parentID=DS_NAS_WDG_PR734] [/cover]  */
static Std_ReturnType Wdg_lChangeMode(WdgIf_ModeType Mode, uint8 ServiceId);

/*Function to operate the Service timer in respective WDG mode */
static void Wdg_lStartOrStopTimeEngine(WdgIf_ModeType Mode, uint8 ServiceId);

/* Function to calculate Timeout counter */
static void Wdg_lTimeoutHandler(WdgIf_ModeType Mode, uint16 timeout,\
                                                           uint8 ServiceId);

/* Function to trigger the Watchdog Hardware cyclically */
static void Wdg_lTrigger(void);
  
#if (WDG_DEV_ERROR_DETECT == STD_ON)
/* Function to check if hardware specific Configuration paramenters
are in range */
static Std_ReturnType Wdg_lInitParamRangeCheck(void);

/* Funtion to check for DET during Mode Change for WDG */
static Std_ReturnType Wdg_lSetModeDetCheck(WdgIf_ModeType Mode);

#endif
 /* (WDG_DEV_ERROR_DETECT == STD_ON) */

#endif/*WDG_MAXQM_TIMERS != 0U */

#if (WDG_DEV_ERROR_DETECT == STD_ON)
/* Funtion to check for DET during WDG Init */
static Std_ReturnType Wdg_lInitDetCheck(const Wdg_17_Scu_ConfigType* ConfigPtr);

#endif

#define WDG_17_SCU_STOP_SEC_CODE
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

/*******************************************************************************
**                      Global Constant Definitions                           **
*******************************************************************************/

/*******************************************************************************
**                      Global Variable Definitions                           **
*******************************************************************************/


/*******************************************************************************
**                      Private Constant Definitions                          **
*******************************************************************************/

#if(WDG_PB_FIXEDADDR == STD_ON)
#define WDG_17_SCU_START_SEC_CONST_32BIT
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h" 
/* To store the Wdg driver configuration pointer (Fixed address) */
/*  TRACEABILITY: [cover parentID=DS_NAS_WDG_PR115][/cover] */
const Wdg_17_Scu_ConfigType * const Wdg_kConfigPtr = &Wdg_ConfigRoot[0];
#define WDG_17_SCU_STOP_SEC_CONST_32BIT
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"
#endif  /*(WDG_PB_FIXEDADDR == STD_ON)*/

