xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/wdg_17_scu_infineon_tricore/ssc/src/Wdg_17_Scu.c
/*******************************************************************************
**                      Private Variable Definitions                          **
*******************************************************************************/

#if(WDG_PB_FIXEDADDR == STD_OFF)

#define WDG_17_SCU_START_SEC_VAR_32BIT
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

/* To store the Wdg Driver configuration pointer */
const Wdg_17_Scu_ConfigType *Wdg_kConfigPtr;

#define WDG_17_SCU_STOP_SEC_VAR_32BIT
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h" 
#endif /*(WDG_PB_FIXEDADDR == STD_OFF)*/

/* Below variales are available for WDG QM */
#if(WDG_MAXQM_TIMERS != 0U)

#define WDG_17_SCU_START_SEC_VAR_16BIT
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

/*  [cover parentID=DS_AS40X_WDG153] [/cover]  */
#if (WDG_DEBUG_SUPPORT == STD_ON)
/* Wdg Timeout counter */
/*IFX_MISRA_RULE_08_10_STATUS=Variable Wdg_TimeoutCounter is declared as
 extern in Wdg_17_Scu_Dbg.h, which will be included application for
 debugging*/
uint16 Wdg_TimeoutCounter[WDG_MAX_TIMERS];
#else
static uint16 Wdg_TimeoutCounter[WDG_MAX_TIMERS];
#endif /*(WDG_DEBUG_SUPPORT == STD_ON)*/

static uint16 Wdg_CurrentReloadValue[WDG_MAX_TIMERS];

#define WDG_17_SCU_STOP_SEC_VAR_16BIT
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

#define WDG_17_SCU_START_SEC_VAR_UNSPECIFIED
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

/*  [cover parentID=DS_AS40X_WDG152] [/cover]  */
#if (WDG_DEBUG_SUPPORT == STD_ON)
/* Driver Internal State, Assigned Default state: WDG_UNINIT */
/*IFX_MISRA_RULE_08_10_STATUS=Variable Wdg_17_Scu_DriverState is declared as
 extern in Wdg_17_Scu_Dbg.h, which will be included application for
 debugging*/
Wdg_17_Scu_StatusType Wdg_17_Scu_DriverState[WDG_MAX_TIMERS];
#elif (WDG_DEV_ERROR_DETECT == STD_ON)
/* Driver Internal State, Assigned Default state: WDG_UNINIT */
static Wdg_17_Scu_StatusType Wdg_17_Scu_DriverState[WDG_MAX_TIMERS];
#endif    /*(WDG_DEBUG_SUPPORT == STD_ON)*/

/*  [cover parentID=DS_AS40X_WDG154,DS_AS40X_WDG148] [/cover]  */
#if (WDG_DEBUG_SUPPORT == STD_ON)
/* Driver current mode */
/*IFX_MISRA_RULE_08_10_STATUS=Variable Wdg_17_Scu_DriverMode is declared as
 extern in Wdg_17_Scu_Dbg.h, which will be included application for
 debugging*/
WdgIf_ModeType Wdg_17_Scu_DriverMode[WDG_MAX_TIMERS];
#else
/* Driver current mode */
static WdgIf_ModeType Wdg_17_Scu_DriverMode[WDG_MAX_TIMERS];
#endif    /*(WDG_DEBUG_SUPPORT == STD_ON)*/

#define WDG_17_SCU_STOP_SEC_VAR_UNSPECIFIED
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"
#endif 
/* WDG_MAXQM_TIMERS != 0U */
/*******************************************************************************
**                      Global Function Definitions                           **
*******************************************************************************/
#define WDG_17_SCU_START_SEC_CODE
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

/*******************************************************************************
** Syntax         :IFX_LOCAL_INLINE uint32 Wdg_lAccessPassword(uint32 WdtCon0) *
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters(in)   : WDTCON0 register                                        **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : uint32 (modified wdtCon0)                               **
**                                                                            **
** Description      : Function to Access password before accessing ENDINIT    **
**                      registers                                             **
**                      Password Access:                                      **
**       - (Bits[15:8])Set previous password bits                             **
**       - (Bits[7:2]) calculate the Inverted bits from previous password     **
**       - (Bit[1]) Set WDTLCK to '0' to unlock SCU_WDTCPUx_CON0              **
**       - (Bit[0]) Set ENDINIT bit while password access                     **
*******************************************************************************/
IFX_LOCAL_INLINE uint32 Wdg_lAccessPassword(uint32 WdtCon0)
{
  /* "volatile" keyword added, to avoid incorrect assembly generation 
      by WINDRIVER compiler only */
  volatile uint32 lPasswordAccess;

  /* Keep bits[15:8] as is */
  lPasswordAccess = (uint32)(WdtCon0 & WDT_PASS_UPPER_MASK);
  /* Invert the bits[7:2] */ 
  lPasswordAccess |= (uint32)((uint32)(~WdtCon0) & WDT_PASS_LOWER_MASK);
  /* Set ENDINIT bit, Clear LCK bit */
  lPasswordAccess |= (uint32)(1U);
  /* Get Reload value */
  lPasswordAccess |= (uint32)(WdtCon0 & WDG_MASK_WDTREL);
  /* CON0 SFR with new password */
  return (lPasswordAccess);
}

/*******************************************************************************
** Syntax     :  IFX_LOCAL_INLINE Std_ReturnType Wdg_lCheckPassSeqOrTimeCheck **
**                                                        (void)              **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Re-entrant                                              **
**                                                                            **
** Parameters(in)   : void                                                    **
**                                                                            **
** Parameters (out) : RetVal                                                  **
**                                                                            **
** Return value     : E_OK/E_NOT_OK                                           **
**                                                                            **
** Description      : Function to Check if  Password Sequencing Or            **
**                    Time Checking is enabled                                **
*******************************************************************************/
IFX_LOCAL_INLINE Std_ReturnType Wdg_lCheckPassSeqOrTimeCheck(void)
{
  uint8 CoreId;
  uint32 lPassSeqOrTimeChck;
  Std_ReturnType RetVal;

