xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/wdg_17_scu_infineon_tricore/ssc/src/Wdg_17_Scu.c
  RetVal = E_OK;
  CoreId = WDG_SFR_INIT_GETCOREID();

  /* Create Mask value for PAS and TCS bit fields of Status register */
  lPassSeqOrTimeChck = (uint32)(((uint32)1U << IFX_SCU_WDTCPU_SR_PAS_OFF) |   \
                                ((uint32)1U << IFX_SCU_WDTCPU_SR_TCS_OFF));

  /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
    access into WDTCPUxSR SFR register */
  lPassSeqOrTimeChck &= \
                 (uint32)WDG_SFR_INIT_USER_MODE_READ32(WDG_REGMAP[CoreId].SR.U);

  if(lPassSeqOrTimeChck != 0U)
  {
    /* Time checking or Password Sequencing enabled */
    #if (WDG_INIT_FAILED_DEM_REPORT == ENABLE_DEM_REPORT)
    Dem_ReportErrorStatus((Dem_EventIdType)WDG_E_INIT_FAILED,                 \
                           DEM_EVENT_STATUS_FAILED);
    #endif
    RetVal = E_NOT_OK;
  }
  return RetVal;
}

/*******************************************************************************
** Syntax     :  IFX_LOCAL_INLINE uint32 Wdg_lModifyAccessPassword            **
**                                       (uint32 PasswordAccess)              **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Re-entrant                                              **
**                                                                            **
** Parameters(in)   : void                                                    **
**                                                                            **
** Parameters (out) : RetVal                                                  **
**                                                                            **
** Return value     : E_OK/E_NOT_OK                                           **
**                                                                            **
** Description      : Function to calculate the password to be                **
**                             put in CON0 SFR                                **
*******************************************************************************/
IFX_LOCAL_INLINE uint32 Wdg_lModifyAccessPassword(uint32 PasswordAccess)
{
  /* Calculate only password */
  PasswordAccess = (uint32)(PasswordAccess & WDT_PASS_MASK);
  
  /* Set LCK bit and ENDINIT Bit */
  PasswordAccess |= WDT_SETLCK_ENDINIT;

  return (PasswordAccess);
}

/*******************************************************************************
** Syntax           :IFX_LOCAL_INLINE uint32 Wdg_lReloadModifyAccess          **
**                                                (uint16 ReloadValue)        **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-reentrant                                           **
**                                                                            **
** Parameters(in)   : ReloadValue (in ticks)                                  **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : uint32 (modified Value)                                 **
**                                                                            **
** Description      : Function to Modify the ENDINIT registers                **
*******************************************************************************/
IFX_LOCAL_INLINE uint32 Wdg_lReloadModifyAccess(uint16 ReloadValue)
{
  /* Create Value for the bit field REL(Bit: 31:16) */
  return (uint32)((((uint32)(ReloadValue)) << WDG_REL_SHIFT_VALUE)&          \
                                 WDG_MASK_WDTREL);
}

/*******************************************************************************
** Traceability     : [cover parentID=DS_AS_WDG064, DS_AS_WDG001,
                      DS_AS_WDG019, DS_AS_WDG025, DS_AS_WDG089,DS_AS40X_WDG173,
                      DS_AS_WDG101, DS_AS_WDG051,DS_AS_WDG106_WDG100,
                      DS_NAS_WDG_PR759_PR760_PR761,DS_MCAL_WDG_050]           **
**                                                                            **
** Syntax           : void Wdg_17_Scu_Init( const Wdg_17_Scu_ConfigType       **
**                                                            *ConfigPtr )    **
**                    [/cover]                                                **
**                                                                            **
** Service ID       : 0                                                       **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-reentrant                                           **
**                                                                            **
** Parameters(in)   : ConfigPtr (Pointer to configuration set)                **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None                                                    **
**                                                                            **
** Description      : Driver Module Initialization function. This routine     **
**                    initializes the watchdog driver and watchdog hardware   **
**                    i.e it sets the default watchdog mode and timeout       **
**                    period as provided in the configuration set. This       **
**                    configuration set shall be chosen from a limited number **
**                    of statically configured sets.                          **
**                    - WDG001: WDG028:                                       **
*******************************************************************************/
void Wdg_17_Scu_Init(const Wdg_17_Scu_ConfigType* ConfigPtr)
{
#if (WDG_MAXSAFE_TIMERS != 0U)
  uint16 PasswordInit;
  uint8 SafeArrayIdx;
#endif

