xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/wdg_17_scu_infineon_tricore/ssc/src/Wdg_17_Scu.c
  Std_ReturnType ErrorFlag;
  uint8 CoreId;

  CoreId = WDG_SFR_INIT_GETCOREID();

  /* Wdg_lInitDetCheck checks ConfigPtr */
  #if (WDG_DEV_ERROR_DETECT == STD_ON)
  ErrorFlag = Wdg_lInitDetCheck(ConfigPtr);
  if(ErrorFlag != E_NOT_OK)
  #endif
   /*(WDG_DEV_ERROR_DETECT == STD_ON)*/
  {
    ErrorFlag = Wdg_lCheckPassSeqOrTimeCheck();
    if(ErrorFlag == E_OK)
    {
      #if(WDG_PB_FIXEDADDR == STD_OFF)
      Wdg_kConfigPtr = ConfigPtr;
      #else
      UNUSED_PARAMETER(ConfigPtr)
      #endif

      #if (WDG_MAXQM_TIMERS != 0U)
      /*WDGx QM driver initialization */
      if(Wdg_kConfigPtr->WdgSafetyProperty[CoreId] == 0U)
      {
        Wdg_lQmInit(Wdg_kConfigPtr);
      }/* WdgSafetyProperty[CoreId]==0U */
      #endif
  
      #if (WDG_MAXSAFE_TIMERS != 0U)
      /*WDGx safety driver initialization */ 
      if(Wdg_kConfigPtr->WdgSafetyProperty[CoreId] == 1U)
      {
        /* Get the index value for Initial password */
        SafeArrayIdx = (uint8)ConfigPtr->WdgSafeIndex[CoreId];
      
        /* get initial password*/
        PasswordInit = (uint16)ConfigPtr->InitialPassword[SafeArrayIdx];
      
        Wdg_lSafetyInit(Wdg_kConfigPtr, PasswordInit, WDG_INIT_ACCESS);
      }/* WdgSafetyProperty[CoreId] == 1U */
      #endif
    }
  } /* End of (ErrorFlag != E_NOT_OK) */
}/* End of Wdg_17_Scu_Init */

#if (WDG_MAXQM_TIMERS != 0U)
/*******************************************************************************
** Traceability     : [cover parentID=DS_AS_WDG064, DS_AS40X_WDG016,
                      DS_AS_WDG017, DS_AS_WDG018, DS_AS_WDG026,DS_AS_WDG107,
                      DS_AS_WDG031, DS_AS_WDG091, DS_AS_WDG103,DS_AS_WDG160,
                      DS_NAS_WDG_PR759_PR760_PR761]                           **
**                                                                            **
** Syntax           : Std_ReturnType Wdg_17_Scu_SetMode( WdgIf_ModeType Mode )**
**                    [/cover]                                                **
**                                                                            **
** Service ID       : 1                                                       **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-reentrant                                           **
**                                                                            **
** Parameters (in)  : WdgIf_ModeType Mode                                     **
**                      One of the following statically configured modes:     **
**                      1. WDGIF_OFF_MODE                                     **
**                      2. WDGIF_SLOW_MODE                                    **
**                      3. WDGIF_FAST_MODE                                    **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : Std_ReturnType (E_OK or E_NOT_OK)                       **
**                                                                            **
** Description      : By choosing one of a limited number of statically       **
**                    configured settings (e.g. toggle or window watchdog,    **
**                    different timeout periods) the watchdog driver and      **
**                    hardware can be switched between the following three    **
**                    different watchdog Modes Off or Slow or Fast:           **
**                    - WDG004:, WDG031:                                      **
*******************************************************************************/
Std_ReturnType Wdg_17_Scu_SetMode(WdgIf_ModeType Mode)
{
  uint16 TimeoutValue;
  WdgIf_ModeType PreviousMode;
  uint8 GtmModuleNumber;
  uint8 GtmChannelNumber;
  uint8 GtmArrayIdx;
  
  /* Return value indicating the result of this function execution:
       E_NOT_OK or E_OK*/
  Std_ReturnType ReturnValue;
  uint8 CoreId;
  CoreId = WDG_SFR_RUNTIME_GETCOREID();
  /* Report the development errors only if WDG_DEV_ERROR_DETECT is STD_ON */
  #if (WDG_DEV_ERROR_DETECT == STD_ON)
  /* Check for Idle State WDG017: */
  ReturnValue = Wdg_lSetModeDetCheck(Mode);

  if (ReturnValue==E_OK)
  #endif
  {
    /* Check if the Wachdog disable is not allowed */
    #if (WDG_DISABLE_ALLOWED == STD_OFF)
    /* Check if the requested mode is OFF_MODE but WDG Disable is not allowed,
       then report error */
    if (Mode == WDGIF_OFF_MODE)
    {
      #if (WDG_DISABLE_REJECT_DEM_REPORT == ENABLE_DEM_REPORT)
      /* Report Production errors to DEM - WDG010: WDG012: WDG026: WDG025:*/
      Dem_ReportErrorStatus((Dem_EventIdType)WDG_E_DISABLE_REJECTED,
                             DEM_EVENT_STATUS_FAILED);
      #endif
      /* Set error flag */
      ReturnValue = E_NOT_OK;
    }
    else
    {
      ReturnValue = E_OK;
    }

    if(ReturnValue == E_OK)
    #endif
    /* (WDG_DISABLE_ALLOWED == STD_OFF) */
    {
      GtmArrayIdx = Wdg_kConfigPtr->WdgQmIndex[CoreId];     
      /* Enter the critical section */
      SchM_Enter_Wdg_17_Scu_TimerHandling();

      #if ((WDG_DEV_ERROR_DETECT == STD_ON) || (WDG_DEBUG_SUPPORT == STD_ON))
      /* Set Driver State to Busy - WDG018: */
      Wdg_17_Scu_DriverState[CoreId] = WDG_BUSY;
      #endif  
      /*(WDG_DEV_ERROR_DETECT == STD_ON)||(WDG_DEBUG_SUPPORT == STD_ON)*/

      /* Hold the previous mode information */
      PreviousMode = Wdg_17_Scu_DriverMode[CoreId];
      /* Diasble GTM channel before mode change*/
      /*Read GTM module number  */
      GtmModuleNumber = \
               Wdg_kConfigPtr->GtmConf[GtmArrayIdx].GtmModuleNumberForService;
      /*Read GTM channel number  */
      GtmChannelNumber = \
                Wdg_kConfigPtr->GtmConf[GtmArrayIdx].GtmChannelNumberForService;
      
     /* ATOM/TOM channel module is disabled*/
        Wdg_lDisableGtmChannel(GtmArrayIdx,GtmModuleNumber,GtmChannelNumber,
                                                       WDG_RUNTIME_ACCESS);
      
