xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/wdg_17_scu_infineon_tricore/ssc/src/Wdg_17_Scu.c
        /* Set WDG to the given Mode */
      ReturnValue = Wdg_lChangeMode(Mode, WDG_RUNTIME_ACCESS);

      /* Check if there was an error during mode switching */
      if (ReturnValue != E_OK)
      {
        #if (WDG_MODE_FAIL_DEM_REPORT == ENABLE_DEM_REPORT)

        /* Report Production errors to DEM - WDG010: WDG012: WDG016: */
        Dem_ReportErrorStatus((Dem_EventIdType)WDG_E_MODE_FAILED,
                                DEM_EVENT_STATUS_FAILED);

        #endif
         /* #if (WDG_MODE_FAIL_DEM_REPORT == ENABLE_DEM_REPORT) */
      }
      else
      {
           /* Update the current mode of Wdg driver */
        Wdg_17_Scu_DriverMode[CoreId] = Mode;
        if(PreviousMode == WDGIF_OFF_MODE)
        {
          /* Wdg_TimeoutCounter will be set in the next
                         Wdg_17_Scu_SetTriggerCondition call which should be
                         done immediately,in case of transition from OFF mode
                         to any other mode.*/
          TimeoutValue = WDG_INITIAL_TIMEOUT;
        }
        else if(PreviousMode == WDGIF_SLOW_MODE)
        {
          TimeoutValue = Wdg_TimeoutCounter[CoreId] *
            Wdg_kConfigPtr->GtmConf[GtmArrayIdx].SlowServiceGtmCbkTime;
        } 
        else 
        {
          TimeoutValue = Wdg_TimeoutCounter[CoreId] * 
               Wdg_kConfigPtr->GtmConf[GtmArrayIdx].FastServiceGtmCbkTime;
        }
        /* Calculate Timeout counter for the remaining timeout value */
        Wdg_lTimeoutHandler(Wdg_17_Scu_DriverMode[CoreId],TimeoutValue,\
                                                            WDG_RUNTIME_ACCESS);
        Wdg_lStartOrStopTimeEngine(Mode,WDG_RUNTIME_ACCESS);
      }
      
      #if ((WDG_DEV_ERROR_DETECT == STD_ON) || (WDG_DEBUG_SUPPORT == STD_ON))
      /* Set Driver State to Idle - WDG018: */
      Wdg_17_Scu_DriverState[CoreId] = WDG_IDLE;
      #endif
      /*(WDG_DEV_ERROR_DETECT == STD_ON)||(WDG_DEBUG_SUPPORT == STD_ON)*/

      /* Exit the critical section */
      SchM_Exit_Wdg_17_Scu_TimerHandling();
    }
  }
  /* Return the end status of execution of this function */
  return (ReturnValue); /* WDG032: WDG008: */
}/* End of Wdg_17_Scu_SetMode */

/*******************************************************************************
** Traceability     : [cover parentID= DS_AS40X_WDG144,
                    DS_AS40X_WDG146, DS_AS40X_WDG155,
                    DS_NAS_WDG_PR759_PR760_PR761]                             **
**                                                                            **
** Syntax           : void Wdg_17_Scu_SetTriggerCondition(uint16 timeout)     **
**                    [/cover]                                                **
**                                                                            **
** Service ID       : 0x03                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-reentrant                                           **
**                                                                            **
** Parameters(in)   : uint16 timeout                                          **
**                    Timeout value (milliseconds) for setting the trigger    **
**                    counter.                                                **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None                                                    **
**                                                                            **
** Description      : The function Wdg_17_Scu_SetTriggerCondition shall sets  **
**                    Timeout value (milliseconds) for setting the trigger    **
**                    counter - WDG144:                                       **
**                                                                            **
*******************************************************************************/
void Wdg_17_Scu_SetTriggerCondition(uint16 timeout)
{
  uint8 CoreId;
  CoreId = WDG_SFR_RUNTIME_GETCOREID();
  #if ( (WDG_DEV_ERROR_DETECT == STD_ON) && (WDG_MAX_TIMEOUT < 65535U) )
  /* When development error detection is enabled for the module, check that the
     timeout parameter given is less or equal to the maximum timeout value
     (WdgMaxTimeout)  WDG146:*/
  /* To avoid compiler warning "condition is always false" */
  if(timeout > (uint16)WDG_MAX_TIMEOUT )
  {
    /* REPORT TO DET - WDG010: WDG045: WDG035: WDG066:*/
    Det_ReportError( WDG_17_SCU_MODULE_ID, WDG_17_SCU_INSTANCE_ID,
                     WDG_SID_TRIGGER_CONDITION, WDG_E_PARAM_TIMEOUT );
  }
  else
  #endif 
  /* #if (WDG_DEV_ERROR_DETECT == STD_ON) */
  {
    /* Enter the critical section*/
    SchM_Enter_Wdg_17_Scu_TimerHandling();

    /* Check that OFF mode is not the current mode */
    if (Wdg_17_Scu_DriverMode[CoreId] != WDGIF_OFF_MODE)
    {
      /* Trigger the Watchdog hardware */
      Wdg_lTrigger();
    }

    /*Restart the GTM timer after setting the new window time*/
    Wdg_lStartOrStopTimeEngine(Wdg_17_Scu_DriverMode[CoreId],\
                                                     WDG_RUNTIME_ACCESS);

    /* Calculate Timeout counter for the new timeout parameter */
    Wdg_lTimeoutHandler(Wdg_17_Scu_DriverMode[CoreId],timeout,\
                                                     WDG_RUNTIME_ACCESS);
    /* Exit the critical section*/
    SchM_Exit_Wdg_17_Scu_TimerHandling();
  }
} /* End of Wdg_17_Scu_SetTriggerCondition  */

/*******************************************************************************
**                      Private Function Definitions                          **
*******************************************************************************/

