xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/wdg_17_scu_infineon_tricore/ssc/src/Wdg_17_Scu.c
    /* Store the current reload value */
    Wdg_CurrentReloadValue[CoreId] = ReloadValue;
    /* To update WDTx_CON1 in Supervisor mode,
      i.e., WDG_REGMAP[CoreId].CON1.U = (uint32)ClockDivider; */
    if (ServiceId == WDG_INIT_ACCESS)
    {
       WDG_SFR_INIT_RESETENDINIT();
       /* Set the clock divider */
       /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
        write  into WDTCON1 SFR register */
       WDG_SFR_INIT_MODIFY32(WDG_REGMAP[CoreId].CON1.U,\
                     ((uint32)(ClockDivider)), (uint32)ClockDivider)
       WDG_SFR_INIT_SETENDINIT();

       /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
       access the password from WDTCON0 SFR register */
       WdtCon0 = (uint32)WDG_SFR_INIT_USER_MODE_READ32                         \
                                                 (WDG_REGMAP[CoreId].CON0.U);
       /* PASSWORD ACCESS */
       WdtCon0 = Wdg_lAccessPassword(WdtCon0);
       /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
       write the modified password into WDTCON0 SFR register */
       WDG_SFR_INIT_USER_MODE_WRITE32(WDG_REGMAP[CoreId].CON0.U,               \
                                                          (uint32)WdtCon0);
       WdtCon0 = Wdg_lModifyAccessPassword(WdtCon0);
      /* MODIFY ACCESS - WDG145:*/
      WdtCon0 |= Wdg_lReloadModifyAccess(ReloadValue);
      /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
      write the modified password and reload value into WDTCON0 SFR register */
      WDG_SFR_INIT_USER_MODE_WRITE32(WDG_REGMAP[CoreId].CON0.U,(uint32)WdtCon0);
    }
    else
    {
      /* Reset ENDINIT bit in SCU_WDTCPU0_CON0 to modify SCU_WDTCPU0_CON1 */
      WDG_SFR_RUNTIME_RESETENDINIT();
      /* Set the clock divider */
      /*IFX_MISRA_RULE_17_04_STATUS==Pointer arithmetic is used to efficiently
      write the ClockDivider value into WDTCON1 SFR register */
      WDG_SFR_RUNTIME_WRITE32(WDG_REGMAP[CoreId].CON1.U,(uint32)ClockDivider);
      /* Set ENDINIT bit in SCU_WDTCPU0_CON0 to lock SCU_WDTCPU0_CON1 */
      WDG_SFR_RUNTIME_SETENDINIT();

      /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
      access the password from WDTCON0 SFR register */
      WdtCon0 = (uint32)WDG_SFR_RUNTIME_USER_MODE_READ32                       \
                                                (WDG_REGMAP[CoreId].CON0.U);
      /* PASSWORD ACCESS */
      WdtCon0 = Wdg_lAccessPassword(WdtCon0);
      /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
      write the modified password into WDTCON0 SFR register */
      WDG_SFR_RUNTIME_USER_MODE_WRITE32(WDG_REGMAP[CoreId].CON0.U,             \
                                                               (uint32)WdtCon0);
      WdtCon0 = Wdg_lModifyAccessPassword(WdtCon0);
      /* MODIFY ACCESS - WDG145:*/
      WdtCon0 |= Wdg_lReloadModifyAccess(ReloadValue);
      /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
      write the modified password and reload value into WDTCON0 SFR register */
      WDG_SFR_RUNTIME_USER_MODE_WRITE32(WDG_REGMAP[CoreId].CON0.U,             \
                                                              (uint32)WdtCon0);
    }
    /* Exit critical section - WDG040: */
    SchM_Exit_Wdg_17_Scu_ChangeMode();

    /* Check for the used clock divider */
    if ( ClockDivider == WDG_SET_WDTIR_RESET_WDTDR)
    {
      if (ServiceId == WDG_INIT_ACCESS)
      {
        /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
        access the WDT Status SFR register to check Changemode was successful*/
        if (((uint32)WDG_SFR_INIT_USER_MODE_READ32(WDG_REGMAP[CoreId].SR.U) & \
        WDG_STATUS_MASK) == WDG_SET_WDTIR_RESET_WDTDR)
          {
          ChangeModeDone = E_OK; /* ChangeMode was succesful */
          }
      }
      else
      {
        /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
        access the WDT Status SFR register to check Changemode was successful*/
        if (((uint32)WDG_SFR_RUNTIME_USER_MODE_READ32(WDG_REGMAP[CoreId].SR.U) \
        & WDG_STATUS_MASK) == WDG_SET_WDTIR_RESET_WDTDR)
          {
          ChangeModeDone = E_OK; /* ChangeMode was succesful */
          }
      }
    }
    else /* ClockDivider is WDG_CLK_DIVIDER_SLOW */
    {
      if (ServiceId == WDG_INIT_ACCESS)
      {
        /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
        access the WDT Status SFR register to check Changemode was successful*/
        if (((uint32)WDG_SFR_INIT_USER_MODE_READ32(WDG_REGMAP[CoreId].SR.U) & \
                               WDG_STATUS_MASK) == WDG_RESET_WDTIR_RESET_WDTDR)
        {
          ChangeModeDone = E_OK; /* ChangeMode was succesful */
        }
      }
      else
      {
        /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
        access the WDT Status SFR register to check Changemode was successful*/
        if (((uint32)WDG_SFR_RUNTIME_USER_MODE_READ32(WDG_REGMAP[CoreId].SR.U) \
                            & WDG_STATUS_MASK) == WDG_RESET_WDTIR_RESET_WDTDR)
        {
          ChangeModeDone = E_OK; /* ChangeMode was succesful */
        }
      }
    }/* End of 'if ( ClockDivider == WDG_SET_WDTIR_RESET_WDTDR)' */
  } /* End of 'if (Mode == WDGIF_SLOW_MODE)' */
  /* return E_OK if change mode done successfully */
  return ((Std_ReturnType)ChangeModeDone);
}

/*******************************************************************************
** Traceability     : [cover parentID=DS_NAS_WDG_PR759_PR760_PR761]           **
**                                                                            **
** Syntax           : static void Wdg_lStartOrStopTimeEngine                    
**                                     (WdgIf_ModeType Mode, uint8 ServiceId) **
**                                                                            **
**                    [/cover]                                                **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-reentrant                                           **
**                                                                            **
** Parameters(in)   : WdgIf_ModeType Mode                                     **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None                                                    **
**                                                                            **
** Description      : This function starts SRV timer if watchdog SLOW-MODE    **
**                    or FAST-MODE is requested                               **
**                                                                            **
*******************************************************************************/
static void Wdg_lStartOrStopTimeEngine(WdgIf_ModeType Mode, uint8 ServiceId)
{
  uint32 GtmSlowTicks;
  uint32 GtmFastTicks;
  uint8 GtmModuleNumber;
  uint8 GtmChannelNumber;
  uint8 CoreId;
  uint8 GtmArrayIdx;
  /* Get core Id */
  if (ServiceId == WDG_INIT_ACCESS)
  {
    CoreId = WDG_SFR_INIT_GETCOREID();
  }
  else
  {
    CoreId = WDG_SFR_RUNTIME_GETCOREID();
  }
  /* Get GTM index for WDGx */
  GtmArrayIdx = Wdg_kConfigPtr->WdgQmIndex[CoreId];
  /* Enter critical section - WDG040:*/
  SchM_Enter_Wdg_17_Scu_TimerHandling();
  /*Get GTM module number  */
  GtmModuleNumber = (uint8)Wdg_kConfigPtr->GtmConf[GtmArrayIdx]. \
                                           GtmModuleNumberForService;
  /* Get GTM module channel number*/
  GtmChannelNumber = (uint8)Wdg_kConfigPtr->GtmConf[GtmArrayIdx].  \
                                          GtmChannelNumberForService;
  /* Get GTM slow ticks  */
  GtmSlowTicks = Wdg_kConfigPtr->GtmConf[GtmArrayIdx].SlowServiceGtmCbkTicks;
  /* Get GTM fast ticks  */
  GtmFastTicks = Wdg_kConfigPtr->GtmConf[GtmArrayIdx].FastServiceGtmCbkTicks;

  /* ATOM/TOM channel module is disabled*/
  Wdg_lDisableGtmChannel(GtmArrayIdx,GtmModuleNumber,GtmChannelNumber,         \
                                                         ServiceId);

  switch(Mode)
  {
    case WDGIF_OFF_MODE:
    {
      break;
    }
    /* Start SRV timer with corresponding timer ticks value when Watchdog
     SLOW-Mode is requested */
    case WDGIF_SLOW_MODE:
    {
      /* ATOM/TOM channel is enabled*/
      Wdg_lEnableGtmChannel(GtmArrayIdx,GtmModuleNumber,GtmChannelNumber,      \
                                                        GtmSlowTicks,ServiceId);
      break;
    }
      /* Start SRV timer with corresponding timer ticks value when Watchdog
       FAST-Mode is requested */
    case WDGIF_FAST_MODE:
    {
      /* ATOM/TOM channel is enabled*/
      Wdg_lEnableGtmChannel(GtmArrayIdx,GtmModuleNumber,GtmChannelNumber,      \
                                                     GtmFastTicks,ServiceId);
      break;
    }
    default:
    {
      break;
    }
 }
  /* Exit the critical section */
  SchM_Exit_Wdg_17_Scu_TimerHandling();
}

