xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/wdg_17_scu_infineon_tricore/ssc/src/Wdg_17_Scu.c
/*******************************************************************************
** Traceability     : [cover parentID=DS_AS40X_WDG140, DS_AS40X_WDG138,
                    DS_AS40X_WDG139, DS_AS40X_WDG145,
                    DS_NAS_WDG_PR759_PR760_PR761]                             **
**                                                                            **
** Syntax           : static void Wdg_lTimeoutHandler(WdgIf_ModeType Mode,    **
**                    uint16 timeout, uint8 ServiceId)                        **
**                    [/cover]                                                **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-reentrant                                           **
**                                                                            **
** Parameters(in)   : Mode    -     Watchdog mode to be switched,             **
**                    timeout -  Timeout period (in milliseconds)             **
**                               used to calculate Wdg_TimeoutCounter,        **
**                    ServiceId - WDG_INIT_ACCESS, WDG_RUNTIME_ACCESS,        **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None                                                    **
**                                                                            **
** Description      : This function allow to set "0" as the time frame for    **
**                    triggering which will result in an (almost) immediate   **
**                    stop of the watchdog triggering and an (almost)         **
**                    instantaneous watchdog reset of the ECU.                **
**                    This function also calulates the value of Timeout       **
**                    counter if watchdog SLOW-MODE or FAST-MODE is requested **
**                    and resets if OFF-MODE is requested                     **
**                                                                            **
*******************************************************************************/
static void Wdg_lTimeoutHandler(WdgIf_ModeType Mode, uint16 timeout,\
                                                       uint8 ServiceId)
{
  /* Time elapsed in ms relative to the last notification */
  uint16 TimeInms;
  /* Local variable to hold the value of Watchdog Timer Control Register */
  uint32 WdtCon0;
  uint32 PasswordAccess;
  uint32 ModifyAccess;
  uint8 CoreId;
  uint8 GtmArrayIdx;
  if (ServiceId == WDG_INIT_ACCESS)
  {
    CoreId = WDG_SFR_INIT_GETCOREID();
  }
  else
  {
    CoreId = WDG_SFR_RUNTIME_GETCOREID();
  }
  /* Get GTM index */
  GtmArrayIdx = Wdg_kConfigPtr->WdgQmIndex[CoreId];
  /* If an immediate stop of the watchdog triggering and an instantaneous
     watchdog reset of the ECU is requested - WDG140: */
  if(timeout==0U)
  {
    /* Enter critical section - WDG040:*/
    SchM_Enter_Wdg_17_Scu_ChangeMode();

    /* Read the current value of Watchdog Timer Control Register */
    /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
    access the password from WDTCON0 SFR register */
    WdtCon0 = (uint32)WDG_SFR_RUNTIME_USER_MODE_READ32                       \
                                                   (WDG_REGMAP[CoreId].CON0.U);
    /* Servicing the Watchdog Timer is performed in two steps, a Valid Password
      Access followed by a Valid Modify Access - WDG093: WDG094:*/

    /* PASSWORD ACCESS */
    PasswordAccess = Wdg_lAccessPassword(WdtCon0);
    /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
    access the password from WDTCON0 SFR register */
    WDG_SFR_RUNTIME_USER_MODE_WRITE32(WDG_REGMAP[CoreId].CON0.U,\
                                                       (uint32)PasswordAccess);
    /* MODIFY ACCESS */
    ModifyAccess = Wdg_lModifyAccessPassword(PasswordAccess);
    ModifyAccess |= Wdg_lReloadModifyAccess(WDG_INSTANT_RESET_RELOAD_VALUE);
    /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to efficiently
    write the modified password into WDTCON0 SFR register */
    WDG_SFR_RUNTIME_USER_MODE_WRITE32(WDG_REGMAP[CoreId].CON0.U,             \
                                                        (uint32)ModifyAccess);
    /* As user wants a reset, update the watchdog Timeout Counter,
    so that Watchdog hardware timer will not be reloaded
    in the next call of Wdg_17_Scu_Cbk_GtmNotificationSRV */
    Wdg_TimeoutCounter[CoreId] = 0x00U;

    /* Exit critical section - WDG040: */
    SchM_Exit_Wdg_17_Scu_ChangeMode();
  }
  else
  {
    /* Enter the critical section */
    SchM_Enter_Wdg_17_Scu_TimerHandling();
    switch(Mode)
    {
      /* Reset Timeout counter if watchdog OFF_Mode is requested */
      case WDGIF_OFF_MODE:
      {
        /* As user wants OFF mode, update the watchdog Timeout Counter,
         so that Watchdog hardware timer will not be reloaded
         in the next call of Wdg_17_Scu_Cbk_GtmNotificationSRV */
        Wdg_TimeoutCounter[CoreId] = 0x00U;
        break;
      }
      /* Calculate Timeout counter when Watchdog SLOW Mode is requested */
      case WDGIF_SLOW_MODE:
      {
        /* Convert the time in GTM ticks into ms */
        /*MISRA Violation - Cannot be avoided for PB type structure*/
        TimeInms = Wdg_kConfigPtr->GtmConf[GtmArrayIdx].SlowServiceGtmCbkTime;
        Wdg_TimeoutCounter[CoreId] = (uint16)(timeout / TimeInms);
        break;
      }
      /* Calculate Timeout counter when Watchdog Fats Mode is requested */
      case WDGIF_FAST_MODE:
      {
        /* Convert the time in GTM ticks into ms */
        TimeInms = Wdg_kConfigPtr->GtmConf[GtmArrayIdx].FastServiceGtmCbkTime;
        Wdg_TimeoutCounter[CoreId] = (uint16)(timeout / TimeInms);
        break;
      }
      default:
      {
        break;
      }
    }
    /* Exit the critical section */
    SchM_Exit_Wdg_17_Scu_TimerHandling();
  }
}
#if (WDG_DEV_ERROR_DETECT == STD_ON)
/*******************************************************************************
**                                                                            **
** Syntax           : static Std_ReturnType Wdg_lSetModeDetCheck              **
**                    (WdgIf_ModeType Mode)                                   **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-reentrant                                           **
**                                                                            **
** Parameters(in)   : None                                                    **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : E_OK or E_NOT_OK                                        **
**                                                                            **
** Description      : This function checks  the DET's during Mode Change      **
**                                                                            **
*******************************************************************************/
static Std_ReturnType Wdg_lSetModeDetCheck(WdgIf_ModeType Mode)
{
  /* Flag to indiate any DET/DEM Error. */
  Std_ReturnType ErrorFlag;
  uint8 CoreId;
  CoreId = WDG_SFR_RUNTIME_GETCOREID();
  /* Flag initialized to no error*/
  ErrorFlag = E_OK;

  if ( Wdg_17_Scu_DriverState[CoreId] != WDG_IDLE)
  {
    /* Report to DET - WDG010: WDG045: WDG017: WDG066:*/
    Det_ReportError( WDG_17_SCU_MODULE_ID, WDG_17_SCU_INSTANCE_ID,
                     WDG_SID_SETMODE, WDG_E_DRIVER_STATE);
    ErrorFlag = E_NOT_OK; /* Set error flag WDG017: */
  }
  /* Check if Mode is within allowed range - WDG091: */
  else if ( !((Mode == WDGIF_SLOW_MODE) || (Mode == WDGIF_FAST_MODE) || \
             (Mode == WDGIF_OFF_MODE)) )
  {
    /* Report to DET - WDG010: WDG045: WDG008: WDG066: WDG064: WDG091:*/
    Det_ReportError( WDG_17_SCU_MODULE_ID, WDG_17_SCU_INSTANCE_ID,
                     WDG_SID_SETMODE, WDG_E_PARAM_MODE );
    ErrorFlag = E_NOT_OK; /* Set error flag */
  }
  else
  {
    /* Nothing to do */
  }
  return (ErrorFlag);
}/* End of Wdg_lSetModeDetCheck*/

