xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/wdg_17_scu_infineon_tricore/ssc/src/Wdg_17_Scu.c
}/* End of Wdg_lInitDetCheck */

#endif
/* ((WDG_DEV_ERROR_DETECT == STD_ON))*/

#define WDG_17_SCU_STOP_SEC_CODE
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

#if (WDG_MAXQM_TIMERS != 0U)

#define WDG_17_SCU_START_SEC_CALLOUT_CODE
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"
/*******************************************************************************
** Traceability     : [cover parentID= DS_AS40X_WDG035,              
                      DS_AS40X_WDG134, DS_AS40X_WDG135, DS_AS40X_WDG166,
                      DS_AS40X_WDG052,DS_NAS_WDG_PR759_PR760_PR761]           **
**                                                                            **
** Syntax           : void Wdg_17_Scu_Cbk_GtmNotifySRV(uint8 ModuleType,      **
**                     uint8 ModuleNo,uint8 ChannelNo,uint16 IrqNotifVal)     **
**                                                                            **
**                    [/cover]                                                **
**                                                                            **
** Service ID       :                                                         **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-reentrant                                           **
**                                                                            **
** Parameters(in)   : None                                                    **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None                                                    **
**                                                                            **
** Description      : Callback function for SRV timer.                        **
**                    This function is called if SRV timer is expired and     **
**                    triggers the Watchdog hardware timer if Timeout counter **
**                    value has not reached zero.                             **
**                                                                            **
*******************************************************************************/
void Wdg_17_Scu_Cbk_GtmNotifySRV(uint8 ModuleType, uint8 ModuleNo,
                   uint8 ChannelNo,uint16 IrqNotifVal)
{
  uint8 CoreId;
  uint8 GtmModuleNum;
  uint8 GtmChannelNum;
  uint8 GtmArrayIdx;
  /* Unused Parameters*/
  UNUSED_PARAMETER(ModuleType)
  UNUSED_PARAMETER(ModuleNo)
  UNUSED_PARAMETER(ChannelNo)
  UNUSED_PARAMETER(IrqNotifVal)
  /* Get CPU Id */
  CoreId = WDG_SFR_RUNTIME_GETCOREID();
 
  #if (WDG_DEV_ERROR_DETECT == STD_ON)
  /* Check for Idle State */
  if (Wdg_17_Scu_DriverState[CoreId] != WDG_IDLE)
  {
    /* REPORT TO DET - WDG010: WDG045: WDG035: WDG066:*/
    Det_ReportError( WDG_17_SCU_MODULE_ID, WDG_17_SCU_INSTANCE_ID,
                     WDG_SID_GTMNOTIF, WDG_E_DRIVER_STATE );
  }
  else
  #endif
   /* (WDG_DEV_ERROR_DETECT == STD_ON) */
  {
    /* Get GTM index to access */
    GtmArrayIdx = Wdg_kConfigPtr->WdgQmIndex[CoreId];
    /* Get GTM module number  */
    GtmModuleNum = Wdg_kConfigPtr->GtmConf[GtmArrayIdx].
                                               GtmModuleNumberForService;
    /* Get GTM channel number   */
    GtmChannelNum =  
         Wdg_kConfigPtr->GtmConf[GtmArrayIdx].GtmChannelNumberForService;   
    /* Enter the critical section */

    SchM_Enter_Wdg_17_Scu_TimerHandling();

    #if ((WDG_DEV_ERROR_DETECT == STD_ON) || (WDG_DEBUG_SUPPORT == STD_ON))
    /* Set Driver State to Busy - WDG052: */
    Wdg_17_Scu_DriverState[CoreId] = WDG_BUSY;
    #endif 
     /*(WDG_DEV_ERROR_DETECT == STD_ON)||(WDG_DEBUG_SUPPORT == STD_ON)*/

    /* Trigger the watchdog if Wdg_TimeoutCounter has not reached zero,
       otherwise watchdog will not get triggered and watchdog timer will expire
       causing reset - WDG134: WDG135: WDG140:*/

    if(Wdg_TimeoutCounter[CoreId] > 0x00U)
    {
      /* Decrement the Timeout Counter */
      Wdg_TimeoutCounter[CoreId] = Wdg_TimeoutCounter[CoreId] - 0x01U;
      /* Service the Watchdog hardware */
      Wdg_lTrigger();
    }
    else
    {
      /* Disable the GTM channel timer, as further service of WDG is
         not required after window expires*/
 
      /* Disable ATOM/TOM channel */ 
      Wdg_lDisableGtmChannel(GtmArrayIdx,GtmModuleNum,GtmChannelNum,\
                                                           WDG_RUNTIME_ACCESS);
    }
   #if ((WDG_DEV_ERROR_DETECT == STD_ON) || (WDG_DEBUG_SUPPORT == STD_ON))
     /* Set Driver State to Idle - WDG052: */
   Wdg_17_Scu_DriverState[CoreId] = WDG_IDLE;
   #endif
   /*(WDG_DEV_ERROR_DETECT == STD_ON)||(WDG_DEBUG_SUPPORT == STD_ON)*/
   /* Exit the critical section */
   SchM_Exit_Wdg_17_Scu_TimerHandling();
  }
}
#define WDG_17_SCU_STOP_SEC_CALLOUT_CODE
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"
#endif
 /* WDG_MAXQM_TIMERS*/
